results/saturate_ssd/cockroachdb/cockroachdb_noslowmaxthroughput_disk_swapoff_results/exp1_trial_1.txt
Adding shard node URL: jdbc:postgresql://10.0.0.27:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.27:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.27:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 302836
[OVERALL], Throughput(ops/sec), 484.7541243445297
[TOTAL_GCS_Copy], Count, 15
[TOTAL_GC_TIME_Copy], Time(ms), 98
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03236074971271579
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 98
[TOTAL_GC_TIME_%], Time(%), 0.03236074971271579
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 72.9453125
[CLEANUP], MinLatency(us), 30
[CLEANUP], MaxLatency(us), 416
[CLEANUP], 99thPercentileLatency(us), 234
[CLEANUP], 99.9PercentileLatency(us), 416
[UPDATE], Operations, 146801
[UPDATE], AverageLatency(us), 522890.40036512015
[UPDATE], MinLatency(us), 40352
[UPDATE], MaxLatency(us), 289669119
[UPDATE], 99thPercentileLatency(us), 2297855
[UPDATE], 99.9PercentileLatency(us), 76677119
[UPDATE], Return=OK, 146801