results/saturate_ssd/cockroachdb/cockroachdb_noslowmaxthroughput_disk_swapoff_results/exp1_trial_4.txt
Adding shard node URL: jdbc:postgresql://10.0.0.29:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.29:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.29:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 302490
[OVERALL], Throughput(ops/sec), 505.55059671394093
[TOTAL_GCS_Copy], Count, 15
[TOTAL_GC_TIME_Copy], Time(ms), 105
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03471189130219181
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 105
[TOTAL_GC_TIME_%], Time(%), 0.03471189130219181
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 69.5546875
[CLEANUP], MinLatency(us), 30
[CLEANUP], MaxLatency(us), 312
[CLEANUP], 99thPercentileLatency(us), 269
[CLEANUP], 99.9PercentileLatency(us), 312
[UPDATE], Operations, 152924
[UPDATE], AverageLatency(us), 501807.6152860244
[UPDATE], MinLatency(us), 12024
[UPDATE], MaxLatency(us), 272629759
[UPDATE], 99thPercentileLatency(us), 2545663
[UPDATE], 99.9PercentileLatency(us), 63569919
[UPDATE], Return=OK, 152924